Revit 2027 API
Category.Parent Property
Returns the parent category of this category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Category Parent { get; }
Public ReadOnly Property Parent As Category
	Get
public:
property Category^ Parent {
	Category^ get ();
}
member Parent : Category with get
Return Value
Category
null if this category a not a subcategory
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace